l10n_tr_account_einvoice/api/EArchiveService.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="EArchiveService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:i0="connect.diyalogo.com" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://tempuri.org/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"><wsp:Policy wsu:Id="EArchiveServiceEndpoint_policy"><wsp:ExactlyOne><wsp:All><sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy"><wsp:Policy><sp:TransportToken><wsp:Policy><sp:HttpsToken RequireClientCertificate="false"/></wsp:Policy></sp:TransportToken><sp:AlgorithmSuite><wsp:Policy><sp:Basic256/></wsp:Policy></sp:AlgorithmSuite><sp:Layout><wsp:Policy><sp:Strict/></wsp:Policy></sp:Layout></wsp:Policy></sp:TransportBinding></wsp:All></wsp:ExactlyOne></wsp:Policy><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/Connect.Service"/><xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/><xs:element name="Ping"><xs:complexType><xs:sequence/></xs:complexType></xs:element><xs:element name="PingResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="PingResult" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="Login"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="login" nillable="true" type="q1:LoginType" xmlns:q1="http://schemas.datacontract.org/2004/07/Connect.Service"/></xs:sequence></xs:complexType></xs:element><xs:element name="LoginResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="LoginResult" type="xs:boolean"/><xs:element minOccurs="0" name="token" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="Logout"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="token" nillable="true" type="xs:string"/></xs:sequence></xs:complexType></xs:element><xs:element name="LogoutResponse"><xs:complexType><xs:sequence/></xs:complexType></xs:element><xs:element name="SendEArchiveInvoice"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="token" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="sourceDocument" nillable="true" type="q2:DocumentDataType" xmlns:q2="http://schemas.datacontract.org/2004/07/Connect.Service"/><xs:element minOccurs="0" name="sourceFormat" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="outFormat" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="paramStr" nillable="true" type="q3:ArrayOfstring" xmlns:q3="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/></xs:sequence></xs:complexType></xs:element><xs:element name="SendEArchiveInvoiceResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="SendEArchiveInvoiceResult" type="xs:int"/><xs:element minOccurs="0" name="outDocument" nillable="true" type="q4:DocumentDataType" xmlns:q4="http://schemas.datacontract.org/2004/07/Connect.Service"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetEArchiveInvoiceStatus"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="token" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="guidList" nillable="true" type="q5:ArrayOfstring" xmlns:q5="http://schemas.microsoft.com/2003/10/Serialization/Arrays"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetEArchiveInvoiceStatusResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="statusList" nillable="true" type="q6:ArrayOfInvoiceStatusInfo" xmlns:q6="http://schemas.datacontract.org/2004/07/Connect.Service"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Connect.Service" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Connect.Service"><xs:complexType name="LoginType"><xs:sequence><xs:element minOccurs="0" name="AppStr" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="FirmId" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Password" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="UserName" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Version" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="WorkSpaceNr" type="xs:int"/><xs:element minOccurs="0" name="licenseKey" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="LoginType" nillable="true" type="tns:LoginType"/><xs:complexType name="DocumentDataType"><xs:sequence><xs:element minOccurs="0" name="BinaryData" nillable="true" type="tns:Base64BinaryData"/><xs:element minOccurs="0" name="FileName" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Hash" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="version" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="DocumentDataType" nillable="true" type="tns:DocumentDataType"/><xs:complexType name="Base64BinaryData"><xs:sequence><xs:element minOccurs="0" name="ContentType" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Value" nillable="true" type="xs:base64Binary"/></xs:sequence></xs:complexType><xs:element name="Base64BinaryData" nillable="true" type="tns:Base64BinaryData"/><xs:complexType name="ArrayOfInvoiceStatusInfo"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="InvoiceStatusInfo" nillable="true" type="tns:InvoiceStatusInfo"/></xs:sequence></xs:complexType><xs:element name="ArrayOfInvoiceStatusInfo" nillable="true" type="tns:ArrayOfInvoiceStatusInfo"/><xs:complexType name="InvoiceStatusInfo"><xs:sequence><xs:element minOccurs="0" name="ResponseCode" type="xs:int"/><xs:element minOccurs="0" name="ResponseStatus" type="xs:int"/><xs:element minOccurs="0" name="Status" type="xs:int"/><xs:element minOccurs="0" name="StatusDescription" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Uuid" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="InvoiceStatusInfo" nillable="true" type="tns:InvoiceStatusInfo"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/Arrays"><xs:complexType name="ArrayOfstring"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="string" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="ArrayOfstring" nillable="true" type="tns:ArrayOfstring"/></xs:schema></wsdl:types><wsdl:message name="IEArchiveService_Ping_InputMessage"><wsdl:part name="parameters" element="tns:Ping"/></wsdl:message><wsdl:message name="IEArchiveService_Ping_OutputMessage"><wsdl:part name="parameters" element="tns:PingResponse"/></wsdl:message><wsdl:message name="IEArchiveService_Login_InputMessage"><wsdl:part name="parameters" element="tns:Login"/></wsdl:message><wsdl:message name="IEArchiveService_Login_OutputMessage"><wsdl:part name="parameters" element="tns:LoginResponse"/></wsdl:message><wsdl:message name="IEArchiveService_Logout_InputMessage"><wsdl:part name="parameters" element="tns:Logout"/></wsdl:message><wsdl:message name="IEArchiveService_Logout_OutputMessage"><wsdl:part name="parameters" element="tns:LogoutResponse"/></wsdl:message><wsdl:message name="IEArchiveService_SendEArchiveInvoice_InputMessage"><wsdl:part name="parameters" element="tns:SendEArchiveInvoice"/></wsdl:message><wsdl:message name="IEArchiveService_SendEArchiveInvoice_OutputMessage"><wsdl:part name="parameters" element="tns:SendEArchiveInvoiceResponse"/></wsdl:message><wsdl:message name="IEArchiveService_GetEArchiveInvoiceStatus_InputMessage"><wsdl:part name="parameters" element="tns:GetEArchiveInvoiceStatus"/></wsdl:message><wsdl:message name="IEArchiveService_GetEArchiveInvoiceStatus_OutputMessage"><wsdl:part name="parameters" element="tns:GetEArchiveInvoiceStatusResponse"/></wsdl:message><wsdl:portType name="IEArchiveService"><wsdl:operation name="Ping"><wsdl:input wsaw:Action="http://tempuri.org/IEArchiveService/Ping" message="tns:IEArchiveService_Ping_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IEArchiveService/PingResponse" message="tns:IEArchiveService_Ping_OutputMessage"/></wsdl:operation><wsdl:operation name="Login"><wsdl:input wsaw:Action="http://tempuri.org/IEArchiveService/Login" message="tns:IEArchiveService_Login_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IEArchiveService/LoginResponse" message="tns:IEArchiveService_Login_OutputMessage"/></wsdl:operation><wsdl:operation name="Logout"><wsdl:input wsaw:Action="http://tempuri.org/IEArchiveService/Logout" message="tns:IEArchiveService_Logout_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IEArchiveService/LogoutResponse" message="tns:IEArchiveService_Logout_OutputMessage"/></wsdl:operation><wsdl:operation name="SendEArchiveInvoice"><wsdl:input wsaw:Action="http://tempuri.org/IEArchiveService/SendEArchiveInvoice" message="tns:IEArchiveService_SendEArchiveInvoice_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IEArchiveService/SendEArchiveInvoiceResponse" message="tns:IEArchiveService_SendEArchiveInvoice_OutputMessage"/></wsdl:operation><wsdl:operation name="GetEArchiveInvoiceStatus"><wsdl:input wsaw:Action="http://tempuri.org/IEArchiveService/GetEArchiveInvoiceStatus" message="tns:IEArchiveService_GetEArchiveInvoiceStatus_InputMessage"/><wsdl:output wsaw:Action="http://tempuri.org/IEArchiveService/GetEArchiveInvoiceStatusResponse" message="tns:IEArchiveService_GetEArchiveInvoiceStatus_OutputMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="EArchiveServiceEndpoint" type="tns:IEArchiveService"><wsp:PolicyReference URI="#EArchiveServiceEndpoint_policy"/><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="Ping"><soap:operation soapAction="http://tempuri.org/IEArchiveService/Ping" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="Login"><soap:operation soapAction="http://tempuri.org/IEArchiveService/Login" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="Logout"><soap:operation soapAction="http://tempuri.org/IEArchiveService/Logout" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SendEArchiveInvoice"><soap:operation soapAction="http://tempuri.org/IEArchiveService/SendEArchiveInvoice" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetEArchiveInvoiceStatus"><soap:operation soapAction="http://tempuri.org/IEArchiveService/GetEArchiveInvoiceStatus" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:binding name="EArchiveServiceEndpoint_http" type="tns:IEArchiveService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="Ping"><soap:operation soapAction="http://tempuri.org/IEArchiveService/Ping" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="Login"><soap:operation soapAction="http://tempuri.org/IEArchiveService/Login" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="Logout"><soap:operation soapAction="http://tempuri.org/IEArchiveService/Logout" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SendEArchiveInvoice"><soap:operation soapAction="http://tempuri.org/IEArchiveService/SendEArchiveInvoice" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetEArchiveInvoiceStatus"><soap:operation soapAction="http://tempuri.org/IEArchiveService/GetEArchiveInvoiceStatus" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="EArchiveService"><wsdl:port name="EArchiveServiceEndpoint" binding="tns:EArchiveServiceEndpoint"><soap:address location="https://connectbeta.elogo.com.tr/webservices/EArchiveService.svc"/></wsdl:port><wsdl:port name="EArchiveServiceEndpoint_http" binding="tns:EArchiveServiceEndpoint_http"><soap:address location="http://connectbeta.elogo.com.tr/webservices/EArchiveService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>